InformationRegisters/ПлановаяГотовностьГабаритныхЧертежей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ПлановаяГотовностьГабаритныхЧертежей</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаГотовности</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ГабаритныйЧертеж</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГабаритныеЧертежи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ПлановаяГотовностьПомещений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ПлановаяГотовностьПомещений</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаГотовности</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Помещение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Помещения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Catalogs/ГабаритныеЧертежи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ГабаритныеЧертежи</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Дизайнер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МодельГотоваАвтор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МодельГотоваДата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Помещения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Помещение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Помещения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

InformationRegisters/ПлановаяГотовностьГабаритныхЧертежей/Ext/ManagerModule.bsl
Процедура РасчитатьПлановыеДатыГабаритныхЧерчежей(Сделка, Дата = Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПлановаяГотовностьПомещений.Помещение КАК Помещение,
		|	ПлановаяГотовностьПомещений.ДатаГотовности КАК ДатаГотовности
		|ПОМЕСТИТЬ вт
		|ИЗ
		|	РегистрСведений.ПлановаяГотовностьПомещений.СрезПоследних(&Дата, ) КАК ПлановаяГотовностьПомещений
		|ГДЕ
		|	ПлановаяГотовностьПомещений.Проект = &Проект
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	МАКСИМУМ(ЕСТЬNULL(вт.ДатаГотовности, ДАТАВРЕМЯ(1, 1, 1))) КАК ДатаГотовности,
		|	ГабаритныеЧертежиПомещения.Ссылка КАК ГабаритныйЧертеж
		|ПОМЕСТИТЬ втДата
		|ИЗ
		|	Справочник.ГабаритныеЧертежи.Помещения КАК ГабаритныеЧертежиПомещения
		|		ЛЕВОЕ СОЕДИНЕНИЕ вт КАК вт
		|		ПО ГабаритныеЧертежиПомещения.Помещение = вт.Помещение
		|ГДЕ
		|	ГабаритныеЧертежиПомещения.Ссылка.Проект = &Проект
		|
		|СГРУППИРОВАТЬ ПО
		|	ГабаритныеЧертежиПомещения.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	втДата.ДатаГотовности КАК ДатаГотовности,
		|	втДата.ГабаритныйЧертеж КАК ГабаритныйЧертеж
		|ИЗ
		|	втДата КАК втДата
		|ГДЕ
		|	втДата.ДатаГотовности > ДАТАВРЕМЯ(1, 1, 1)";
	
	Запрос.УстановитьПараметр("Проект", Сделка);
	Запрос.УстановитьПараметр("Дата", ?(Дата = Неопределено, КонецДня(ТекущаяДата()), Дата));
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	
	НаборЗаписей = РегистрыСведений.ПлановаяГотовностьГабаритныхЧертежей.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Сделка.Установить(Сделка);
	
	Пока Выборка.Следующий() Цикл
		НоваяЗапись = НаборЗаписей.Добавить();
		НоваяЗапись.Проект = Сделка;
		ЗаполнитьЗначенияСвойств(НоваяЗапись, Выборка);
	КонецЦикла;  
		
	НаборЗаписей.Записать();
	
КонецПроцедуры
